# Create a dataFrame from scratch

## Method 1- dictionaries ( best Method)

In [227]:
data = {
    "country":    ["Brazil", " Russia","India", "China", "South Africa"],
    "Capital":    ["Brasilia", "Moscow", "New Delhi", "beijing", "Pretoria"],
    "Area":       [8.516, 17.10, 3.286, 9.597, 1.221],
    "population": [200.4, 143.5, 1252, 1357, 52.98 ]}

In [1]:
import pandas as pd

In [229]:
df = pd.DataFrame(data)

In [230]:
df.dtypes

country        object
Capital        object
Area          float64
population    float64
dtype: object

In [ ]:
pd.DataFrame().from_dict()

In [ ]:
pd.DataFrame().from_records()

<h2 id="Method-2---List-data-Method" data-toc-modified-id="Method-2---List-data-Method-1.2"><a id="Method-2---List-data-Method-1.2" class="toc-mod-link"></a><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Method 2 - List data Method (native and zip)</h2>

In [5]:
dataList = [["Brazil","Brasilia",8.516,200.40],
            ["Russia","Moscow",17.100,143.50],
            ["India","New Delhi",3.286,1252.00],
            ["China","beijing",9.597,1357.00],
            ["South Africa","Pretoria",1.221,52.98]]

In [6]:
dflist = pd.DataFrame(dataList)
dflist

              0          1       2        3
0        Brazil   Brasilia   8.516   200.40
1        Russia     Moscow  17.100   143.50
2         India  New Delhi   3.286  1252.00
3         China    beijing   9.597  1357.00
4  South Africa   Pretoria   1.221    52.98

In [7]:
l1=["Brazil", " Russia","India", "China", "South Africa"]
l2=["Brasilia", "Moscow", "New Delhi", "beijing", "Pretoria"]
l3=[8.516, 17.10, 3.286, 9.597, 1.221]
l4=[200.4, 143.5, 1252, 1357, 52.98 ]

finalList = list(zip(l1,l2,l3,l4))
dflist2 = pd.DataFrame(finalList,columns=["country","Capital","Area","population"],)
dflist2

        country    Capital    Area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

<h1 id="A-bit-more-about-columns,-index,-values,Axis&nbsp;" data-toc-modified-id="A-bit-more-about-columns,-index,-values,Axis&nbsp;-2"><a id="A-bit-more-about-columns,-index,-values,Axis&nbsp;-2" class="toc-mod-link"></a><span class="toc-item-num">2&nbsp;&nbsp;</span>A bit more about columns, index, values, Axis&nbsp;</h1>

<h2 id="Change-Axis:" data-toc-modified-id="Change-Axis:-2.1"><a id="Change-Axis:-2.1" class="toc-mod-link"></a><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Change Axis:</h2>
<p><span style="font-size: 14pt;">Most functions accept the axis as their arguments to change their action on rows or columns vice versa. For example, for isna() method axis=0 check a value within columns&nbsp; and axis = 1 check it alongside rows.</span></p>

<h2 id="2.2&nbsp;&nbsp;rename-columns" data-toc-modified-id="2.2&nbsp;&nbsp;rename-columns-2.2"><a id="2.2&nbsp;&nbsp;rename-columns-2.2" class="toc-mod-link"></a><span class="toc-item-num">2.2&nbsp;&nbsp;</span>rename columns</h2>
<p><span style="font-size: 14pt;">rename( columns={old column name: new name})</span></p>

In [10]:
df.rename(columns={"country":"CNTRY","Capital":"CPTL"})

          CNTRY       CPTL    Area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

<h2>Working with Index:&nbsp;</h2>
<p><span style="font-size: 12pt;">Change, define, reset and ....</span></p>

In [11]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
df.setIndex

In [ ]:
df.reindex

In [ ]:
dr.reindex_like

In [ ]:
df.reset_index

In [ ]:
df.sort_index

# Load a dataset from file

In [11]:
oo = pd.read_csv('./datasets/olympics.csv', skiprows=4)

# STEP1:Data Understanding -> head,tail,shape, info, describe,....

In [59]:
oo.head() # oo.tail()

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
0,Athens,1896,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100m freestyle,M,Gold
1,Athens,1896,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100m freestyle,M,Silver
2,Athens,1896,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100m freestyle for sailors,M,Bronze
3,Athens,1896,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100m freestyle for sailors,M,Gold
4,Athens,1896,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100m freestyle for sailors,M,Silver

In [62]:
oo.shape

(29216, 10)

In [63]:
oo.dtypes

City            object
Edition          int64
Sport           object
Discipline      object
Athlete         object
NOC             object
Gender          object
Event           object
Event_gender    object
Medal           object
dtype: object

In [56]:
oo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29216 entries, 0 to 29215
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   City          29216 non-null  object
 1   Edition       29216 non-null  int64
 2   Sport         29216 non-null  object
 3   Discipline    29216 non-null  object
 4   Athlete       29216 non-null  object
 5   NOC           29216 non-null  object
 6   Gender        29216 non-null  object
 7   Event         29216 non-null  object
 8   Event_gender  29216 non-null  object
 9   Medal         29216 non-null  object
dtypes: int64(1), object(9)
memory usage: 2.2+ MB

In [58]:
oo.describe()

            Edition
count  29216.000000
mean    1967.713171
std       32.406293
min     1896.000000
25%     1948.000000
50%     1976.000000
75%     1996.000000
max     2008.000000

In [43]:
oo.describe().T

,count,mean,std,min,25%,50%,75%,max
Edition,29216.0,1967.713171,32.406293,1896.0,1948.0,1976.0,1996.0,2008.0

In [44]:
oo.describe(percentiles = [.3, .90]).T

,count,mean,std,min,30%,50%,90%,max
Edition,29216.0,1967.713171,32.406293,1896.0,1952.0,1976.0,2004.0,2008.0

In [45]:
oo.index

RangeIndex(start=0, stop=29216, step=1)

In [47]:
oo.values

array([['Athens', 1896, 'Aquatics', ..., '100m freestyle', 'M', 'Gold'],
       ['Athens', 1896, 'Aquatics', ..., '100m freestyle', 'M', 'Silver'],
       ['Athens', 1896, 'Aquatics', ..., '100m freestyle for sailors',
        'M', 'Bronze'],
       ...,
       ['Beijing', 2008, 'Wrestling', ..., '96 - 120kg', 'M', 'Bronze'],
       ['Beijing', 2008, 'Wrestling', ..., '96 - 120kg', 'M', 'Gold'],
       ['Beijing', 2008, 'Wrestling', ..., '96 - 120kg', 'M', 'Silver']],
      dtype=object)

In [48]:
oo.columns

Index(['City', 'Edition', 'Sport', 'Discipline', 'Athlete', 'NOC', 'Gender',
       'Event', 'Event_gender', 'Medal'],
      dtype='object')

In [49]:
oo.axes

[RangeIndex(start=0, stop=29216, step=1),
 Index(['City', 'Edition', 'Sport', 'Discipline', 'Athlete', 'NOC', 'Gender',
        'Event', 'Event_gender', 'Medal'],
       dtype='object')]

In [53]:
oo.keys()

Index(['City', 'Edition', 'Sport', 'Discipline', 'Athlete', 'NOC', 'Gender',
       'Event', 'Event_gender', 'Medal'],
      dtype='object')

In [54]:
oo.ndim

2

<h1 id="5&nbsp;&nbsp;Data-type-conversion--&gt;-astype" data-toc-modified-id="5&nbsp;&nbsp;Data-type-conversion--&gt;-astype-5"><a id="5&nbsp;&nbsp;Data-type-conversion--&gt;-astype-5" class="toc-mod-link"></a><span class="toc-item-num">5&nbsp;&nbsp;</span>Data type conversion -&gt; astype</h1>
<p data-toc-modified-id="5&nbsp;&nbsp;Data-type-conversion--&gt;-astype-5"><span style="font-size: 12pt;">category, float,int,str,</span></p>

In [76]:
oo.astype('category').dtypes

City            category
Edition         category
Sport           category
Discipline      category
Athlete         category
NOC             category
Gender          category
Event           category
Event_gender    category
Medal           category
dtype: object

In [70]:
oo["Edition"]=oo["Edition"].astype('category')
oo.Medal = oo.Medal.astype('category')
oo.Event_gender=oo.Event_gender.astype('category')

In [71]:
oo.dtypes

City              object
Edition         category
Sport             object
Discipline        object
Athlete           object
NOC               object
Gender            object
Event             object
Event_gender    category
Medal           category
dtype: object

In [77]:
oo.describe().T

              count unique               top   freq
City          29216     22            Athens   2149
Edition       29216     26              2008   2042
Sport         29216     42          Aquatics   3828
Discipline    29216     56         Athletics   3448
Athlete       29216  21413  LATYNINA, Larisa     18
NOC           29216    138               USA   4335
Gender        29216      2               Men  21721
Event         29216    577          football   1387
Event_gender  29216      3                 M  20067
Medal         29216      3              Gold   9850

# Data Selection -> loc, iloc, coditional, isin

<h2 id="df.loc[-]" data-toc-modified-id="df.loc[-]-6.1"><a id="df.loc[-]-6.1" class="toc-mod-link"></a><span class="toc-item-num">6.1&nbsp;&nbsp;</span>df.loc[ ]</h2>

In [119]:
df['country'][1]

' Russia'

In [120]:
df.loc[1:1,'country']

1     Russia
Name: country, dtype: object

In [121]:
df.iloc[1,0]

' Russia'

In [122]:
df.iloc[1:2,0]

1     Russia
Name: country, dtype: object

In [123]:
df[['country','Capital']][df.index==1]

   country Capital
1   Russia  Moscow

In [124]:
df.loc[1:1,['country','Capital']]

   country Capital
1   Russia  Moscow

In [125]:
df.iloc[1:2,0:2]

   country Capital
1   Russia  Moscow

<h3 id="6.1.1&nbsp;&nbsp;These-commands-do-not-Run!!" data-toc-modified-id="6.1.1&nbsp;&nbsp;These-commands-do-not-Run!!-6.1.1"><span style="font-size: 10pt;"><span style="color: #e03e2d;">These commands do not Run!!</span></span></h3>
<p style="padding-left: 80px;"><span style="font-size: 10pt;"><span style="color: #e03e2d;">oo["City","Sport"]</span></span></p>
<p style="padding-left: 80px;"><span style="font-size: 10pt;"><span style="color: #e03e2d;">oo["City":"Sport"]</span></span></p>
<p style="padding-left: 80px;"><span style="font-size: 10pt;"><span style="color: #e03e2d;">oo[["City":"Sport"]]</span></span></p>
<p style="padding-left: 80px;"><span style="font-size: 10pt;"><span style="color: #e03e2d;">oo[,["City","Sport"]]</span></span></p>
<p style="padding-left: 80px;"><span style="font-size: 10pt;"><span style="color: #e03e2d;">oo[:,["City","Sport"]]</span></span></p>
<p style="padding-left: 80px;"><span style="font-size: 10pt;"><span style="color: #e03e2d;">oo[1:4,["City","Sport"]]</span></span></p>
<h3 id="6.1.2&nbsp;&nbsp;Negative-numbers-are-not-applied-to-loc" data-toc-modified-id="6.1.2&nbsp;&nbsp;Negative-numbers-are-not-applied-to-loc-6.1.2"><span style="font-size: 10pt;"><span style="color: #e03e2d;">Negative numbers are not applied to loc</span></span></h3>
<p style="padding-left: 80px;">&nbsp;</p>

In [118]:
oo[1:4]

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
1,Athens,1896,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100m freestyle,M,Silver
2,Athens,1896,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100m freestyle for sailors,M,Bronze
3,Athens,1896,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100m freestyle for sailors,M,Gold

<h3 id="oo[1]-does-not-return-the-first-ROW!!!" data-toc-modified-id="oo[1]-does-not-return-the-first-ROW!!!-5.0.1"><a id="oo[1]-does-not-return-the-first-ROW!!!-5.0.1" class="toc-mod-link"></a><span class="toc-item-num">5.0.1&nbsp;&nbsp;</span><span style="color: #e03e2d;">oo[1] does not return the first ROW!!!</span></h3>
<p style="padding-left: 120px;"><span style="color: #2dc26b; font-size: 14pt;">but oo[1:2] returns the first row</span></p>

In [111]:
oo.loc[1]

City                      Athens
Edition                     1896
Sport                   Aquatics
Discipline              Swimming
Athlete         HERSCHMANN, Otto
NOC                          AUT
Gender                       Men
Event             100m freestyle
Event_gender                   M
Medal                     Silver
Name: 1, dtype: object

In [112]:
oo.loc[[1]]

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
1,Athens,1896,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100m freestyle,M,Silver

In [24]:
oo.loc[1:4]
# oo.loc[1:4,]  oo.loc[1:4,:] oo.loc[[1,2,3,4]] oo.loc[[1,2,3,4],] oo.loc[[1,2,3,4],:]
# oo.loc[[2:5]] ::error

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
1,Athens,1896,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100m freestyle,M,Silver
2,Athens,1896,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100m freestyle for sailors,M,Bronze
3,Athens,1896,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100m freestyle for sailors,M,Gold
4,Athens,1896,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100m freestyle for sailors,M,Silver

In [27]:
oo.loc[:,'City'].head(3)

0    Athens
1    Athens
2    Athens
Name: City, dtype: object

In [28]:
oo.loc[:,['City']].head(3)

     City
0  Athens
1  Athens
2  Athens

In [35]:
oo.loc[:,'Sport':'NOC'].head(3) # df.loc[:,['City','Edition','Sport','Discipline ', 'Athlete', 'NOC']]

      Sport Discipline            Athlete  NOC
0  Aquatics   Swimming      HAJOS, Alfred  HUN
1  Aquatics   Swimming   HERSCHMANN, Otto  AUT
2  Aquatics   Swimming  DRIVAS, Dimitrios  GRE

In [36]:
oo.iloc[[1,3,5],[2,3,4,5]]

      Sport Discipline                Athlete  NOC
1  Aquatics   Swimming       HERSCHMANN, Otto  AUT
3  Aquatics   Swimming     MALOKINIS, Ioannis  GRE
5  Aquatics   Swimming  CHOROPHAS, Efstathios  GRE

In [32]:
oo.iloc[1:4] # oo.iloc[1:4,]  oo.iloc[[1,2,3]] oo.iloc[[1,2,3],]

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
1,Athens,1896,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100m freestyle,M,Silver
2,Athens,1896,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100m freestyle for sailors,M,Bronze
3,Athens,1896,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100m freestyle for sailors,M,Gold

In [34]:
oo.iloc[:,0:5].head(3) #oo.iloc[:,[0,1,2,3,4]]

     City  Edition     Sport Discipline            Athlete
0  Athens     1896  Aquatics   Swimming      HAJOS, Alfred
1  Athens     1896  Aquatics   Swimming   HERSCHMANN, Otto
2  Athens     1896  Aquatics   Swimming  DRIVAS, Dimitrios

<h2><a id="Attention!!!-6.2" class="toc-mod-link"></a><span class="toc-item-num">6.2&nbsp;&nbsp;</span><span style="color: #e03e2d;">Attention!!!&nbsp;</span>oo.loc[2:5] != oo.iloc[2:5] =oo[2:5]</h2>
<p>&nbsp;</p>

In [ ]:
oo.iloc[]

<h2>query</h2>

<h2>select by dtype</h2>

In [ ]:
df.select_dtypes()

# Data Sorting

In [84]:
oo.Athlete.sort_values()

651                 AABYE, Edgar
2849       AALTONEN, Arvo Ossian
2852       AALTONEN, Arvo Ossian
7716    AALTONEN, Paavo Johannes
7730    AALTONEN, Paavo Johannes
                  ...
603                   STMO, Ole
608                   STMO, Ole
621                   STMO, Ole
596                   STMO, Ole
8051           STRAND, Per-Olof
Name: Athlete, Length: 29216, dtype: object

In [86]:
oo.sort_values("Athlete")

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
651,Paris,1900,Tug of War,Tug of War,"AABYE, Edgar",ZZX,Men,tug of war,M,Gold
2849,Antwerp,1920,Aquatics,Swimming,"AALTONEN, Arvo Ossian",FIN,Men,200m breaststroke,M,Bronze
2852,Antwerp,1920,Aquatics,Swimming,"AALTONEN, Arvo Ossian",FIN,Men,400m breaststroke,M,Bronze
7716,London,1948,Gymnastics,Artistic G.,"AALTONEN, Paavo Johannes",FIN,Men,pommel horse,M,Gold
7730,London,1948,Gymnastics,Artistic G.,"AALTONEN, Paavo Johannes",FIN,Men,team competition,M,Gold
...,...,...,...,...,...,...,...,...,...,...
603,Paris,1900,Shooting,Shooting,"STMO, Ole",NOR,Men,"army rifle, 300m, prone",M,Bronze
608,Paris,1900,Shooting,Shooting,"STMO, Ole",NOR,Men,"army rifle, 300m, standing",M,Silver
621,Paris,1900,Shooting,Shooting,"STMO, Ole",NOR,Men,"free rifle, team",M,Silver
596,Paris,1900,Shooting,Shooting,"STMO, Ole",NOR,Men,"army rifle, 300m, 3 positions",M,Bronze
8051,Helsinki,1952,Aquatics,Swimming,"STRAND, Per-Olof",SWE,Men,400m freestyle,M,Bronze

In [90]:
oo.sort_values("Athlete",ascending=False)

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
8051,Helsinki,1952,Aquatics,Swimming,"STRAND, Per-Olof",SWE,Men,400m freestyle,M,Bronze
621,Paris,1900,Shooting,Shooting,"STMO, Ole",NOR,Men,"free rifle, team",M,Silver
608,Paris,1900,Shooting,Shooting,"STMO, Ole",NOR,Men,"army rifle, 300m, standing",M,Silver
603,Paris,1900,Shooting,Shooting,"STMO, Ole",NOR,Men,"army rifle, 300m, prone",M,Bronze
596,Paris,1900,Shooting,Shooting,"STMO, Ole",NOR,Men,"army rifle, 300m, 3 positions",M,Bronze
...,...,...,...,...,...,...,...,...,...,...
7716,London,1948,Gymnastics,Artistic G.,"AALTONEN, Paavo Johannes",FIN,Men,pommel horse,M,Gold
7730,London,1948,Gymnastics,Artistic G.,"AALTONEN, Paavo Johannes",FIN,Men,team competition,M,Gold
2849,Antwerp,1920,Aquatics,Swimming,"AALTONEN, Arvo Ossian",FIN,Men,200m breaststroke,M,Bronze
2852,Antwerp,1920,Aquatics,Swimming,"AALTONEN, Arvo Ossian",FIN,Men,400m breaststroke,M,Bronze
651,Paris,1900,Tug of War,Tug of War,"AABYE, Edgar",ZZX,Men,tug of war,M,Gold

In [91]:
oo.sort_values(["Athlete","Event"],ascending=[True,False])

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
651,Paris,1900,Tug of War,Tug of War,"AABYE, Edgar",ZZX,Men,tug of war,M,Gold
2852,Antwerp,1920,Aquatics,Swimming,"AALTONEN, Arvo Ossian",FIN,Men,400m breaststroke,M,Bronze
2849,Antwerp,1920,Aquatics,Swimming,"AALTONEN, Arvo Ossian",FIN,Men,200m breaststroke,M,Bronze
7773,London,1948,Gymnastics,Artistic G.,"AALTONEN, Paavo Johannes",FIN,Men,vault,M,Gold
7730,London,1948,Gymnastics,Artistic G.,"AALTONEN, Paavo Johannes",FIN,Men,team competition,M,Gold
...,...,...,...,...,...,...,...,...,...,...
621,Paris,1900,Shooting,Shooting,"STMO, Ole",NOR,Men,"free rifle, team",M,Silver
608,Paris,1900,Shooting,Shooting,"STMO, Ole",NOR,Men,"army rifle, 300m, standing",M,Silver
603,Paris,1900,Shooting,Shooting,"STMO, Ole",NOR,Men,"army rifle, 300m, prone",M,Bronze
596,Paris,1900,Shooting,Shooting,"STMO, Ole",NOR,Men,"army rifle, 300m, 3 positions",M,Bronze
8051,Helsinki,1952,Aquatics,Swimming,"STRAND, Per-Olof",SWE,Men,400m freestyle,M,Bronze

# Add/remove/insert cols and rows

<h2 id="adding-Rows--&gt;-append,-concat,-loc,-iloc" data-toc-modified-id="adding-Rows--&gt;-append,-concat,-loc,-iloc-7.1"><a id="adding-Rows--&gt;-append,-concat,-loc,-iloc-7.1" class="toc-mod-link"></a><span class="toc-item-num">7.1&nbsp;&nbsp;</span>adding Rows -&gt; append, concat, loc, iloc</h2>
<p>this link: https://www.stackvidhya.com/add-row-to-dataframe</p>

<h2>Add columns</h2>

In [45]:
df['NewColumn']=10
df

        country    Capital    Area  population  NewColumn
0        Brazil   Brasilia   8.516      200.40         10
1        Russia     Moscow  17.100      143.50         10
2         India  New Delhi   3.286     1252.00         10
3         China    beijing   9.597     1357.00         10
4  South Africa   Pretoria   1.221       52.98         10

In [46]:
df.newColumn2=10
df

        country    Capital    Area  population  NewColumn
0        Brazil   Brasilia   8.516      200.40         10
1        Russia     Moscow  17.100      143.50         10
2         India  New Delhi   3.286     1252.00         10
3         China    beijing   9.597     1357.00         10
4  South Africa   Pretoria   1.221       52.98         10

<h3><span style="color: #e03e2d;">Attention!!</span> df.newColumn != df['newColumn']</h3>

<h2>Remove columns</h2>

In [244]:
df.drop(columns=['country'])

     Capital    Area  population
0   Brasilia   8.516      200.40
1     Moscow  17.100      143.50
2  New Delhi   3.286     1252.00
3    beijing   9.597     1357.00
4   Pretoria   1.221       52.98

In [245]:
df.drop(['country'],axis=1)

     Capital    Area  population
0   Brasilia   8.516      200.40
1     Moscow  17.100      143.50
2  New Delhi   3.286     1252.00
3    beijing   9.597     1357.00
4   Pretoria   1.221       52.98

<h2>insert column</h2>

In [250]:
df.insert(2,'rank',[1,3,5,3,1],allow_duplicates=True)
df

        country    Capital  rank  rank    Area  population
0        Brazil   Brasilia     1     1   8.516      200.40
1        Russia     Moscow     3     3  17.100      143.50
2         India  New Delhi     5     5   3.286     1252.00
3         China    beijing     3     3   9.597     1357.00
4  South Africa   Pretoria     1     1   1.221       52.98

# Summerizing continues values

# Summerizing categorical Data

# Data grouping and Pivot table

# Descretizing

In [ ]:
df.cut

# Merge,Append, Split dataframe

<h1 id="Searching-within-the-dataset" data-toc-modified-id="Searching-within-the-dataset-13"><a id="Searching-within-the-dataset-13" class="toc-mod-link"></a><span class="toc-item-num">13&nbsp;&nbsp;</span>Searching within the dataset -&gt; isin, between</h1>

In [22]:
oo[oo.Edition.isin([1896])]["Edition"].count()

151

In [23]:
oo[oo.Edition.isin([1896,1900])]["Edition"].count()

663

In [25]:
oo[oo.Edition.between(1896,1904)]["Edition"].count()

1133

In [26]:
oo[oo.Edition.isin([1896,1900,1904])]["Edition"].count()

1133

<h1 id="Data-Encoding" data-toc-modified-id="Data-Encoding-14"><a id="Data-Encoding-14" class="toc-mod-link"></a><span class="toc-item-num">14&nbsp;&nbsp;</span>Data Encoding</h1>
<h2 id="native" data-toc-modified-id="native-14.1"><a id="native-14.1" class="toc-mod-link"></a><span class="toc-item-num">14.1&nbsp;&nbsp;</span>native -&gt; based on adding new column</h2>

In [232]:
import numpy as np
df2=df.copy()

df2['size']=pd.Series(dtype='str')
def fillvalue():
    for item in df2.index:
        if df2.iloc[item,2] < 8 :
            df2.iloc[item,4]='Small'
        elif df2.iloc[item,2] >= 8 and df2.iloc[item,2] < 16:
            df2.iloc[item,4]='Medium'
        else:
            df2.iloc[item,4]='Large'
            
fillvalue()
df2

        country    Capital    Area  population    size
0        Brazil   Brasilia   8.516      200.40  Medium
1        Russia     Moscow  17.100      143.50   Large
2         India  New Delhi   3.286     1252.00   Small
3         China    beijing   9.597     1357.00  Medium
4  South Africa   Pretoria   1.221       52.98   Small

In [243]:
df2['poplevel']='low'
df2.loc[df.population<200,'poplevel']='low'
df2.loc[(df.population>=200) & (df.population<1000),'poplevel' ]='mid'
df2.loc[df.population>=1000,'poplevel']='high'
df2

,country,Capital,Area,population,size,poplevel,sizecode,sizecode2,AreaSqure
0,BRAZIL,BRASILIA,8.516,200.40,Medium,mid,1,1,72.522256
1,RUSSIA,MOSCOW,17.100,143.50,Large,low,2,2,292.410000
2,INDIA,NEW DELHI,3.286,1252.00,Small,high,0,0,10.797796
3,CHINA,BEIJING,9.597,1357.00,Medium,high,1,1,92.102409
4,SOUTH AFRICA,PRETORIA,1.221,52.98,Small,low,0,0,1.490841

In [234]:
df2.dtypes

country        object
Capital        object
Area          float64
population    float64
size           object
poplevel       object
dtype: object

<h2>map</h2>

In [235]:
df2['sizecode']=df2['size'].map({'Medium':'1','Large':'2','Small':'0'})
df2

        country    Capital    Area  population    size poplevel sizecode
0        Brazil   Brasilia   8.516      200.40  Medium      mid        1
1        Russia     Moscow  17.100      143.50   Large      low        2
2         India  New Delhi   3.286     1252.00   Small     high        0
3         China    beijing   9.597     1357.00  Medium     high        1
4  South Africa   Pretoria   1.221       52.98   Small      low        0

<h3><span style="color: #e03e2d;">Attention!!!</span> type(df2.size) =&gt; int32 but type(df2['size'[) =&gt; object</h3>

In [236]:
df2['sizecode2']=df2['size'].map(lambda code:0 if code=='Small'else (1 if code=='Medium' else 2))

In [237]:
df2

,country,Capital,Area,population,size,poplevel,sizecode,sizecode2
0,Brazil,Brasilia,8.516,200.40,Medium,mid,1,1
1,Russia,Moscow,17.100,143.50,Large,low,2,2
2,India,New Delhi,3.286,1252.00,Small,high,0,0
3,China,beijing,9.597,1357.00,Medium,high,1,1
4,South Africa,Pretoria,1.221,52.98,Small,low,0,0

<h2>apply</h2>

In [242]:
def square(x):
    return x ** 2
df2['AreaSqure']=df2['Area'].apply(square)
df2

,country,Capital,Area,population,size,poplevel,sizecode,sizecode2,AreaSqure
0,BRAZIL,BRASILIA,8.516,200.40,Medium,mid,1,1,72.522256
1,RUSSIA,MOSCOW,17.100,143.50,Large,low,2,2,292.410000
2,INDIA,NEW DELHI,3.286,1252.00,Small,high,0,0,10.797796
3,CHINA,BEIJING,9.597,1357.00,Medium,high,1,1,92.102409
4,SOUTH AFRICA,PRETORIA,1.221,52.98,Small,low,0,0,1.490841

In [239]:
df2[['country','Capital']] = df2.apply(lambda x: x[['country','Capital']].str.upper(), axis=1)
df2

,country,Capital,Area,population,size,poplevel,sizecode,sizecode2,AreaSqure
0,BRAZIL,BRASILIA,8.516,200.40,Medium,mid,1,1,72.522256
1,RUSSIA,MOSCOW,17.100,143.50,Large,low,2,2,292.410000
2,INDIA,NEW DELHI,3.286,1252.00,Small,high,0,0,10.797796
3,CHINA,BEIJING,9.597,1357.00,Medium,high,1,1,92.102409
4,SOUTH AFRICA,PRETORIA,1.221,52.98,Small,low,0,0,1.490841

<h2>replace</h2>

<h2>get_dummies</h2>

<h2>where</h2>

<h2>mask</h2>

In [4]:
file = pd.read_spss('..\carpet.sav')

In [3]:
pwd

'd:\\Habil\\python'

In [5]:
file.head()

  package    brand   price seal money  pref
0      A*    Glory   $1.39  Yes    No  16.0
1      B*      K2R   $1.19   No    No   5.0
2      B*    Glory   $1.39   No   Yes   7.0
3      C*    Glory   $1.59   No    No  14.0
4      C*  Bissell   $1.39   No    No  12.0

In [ ]:
pd.read